Revit 2024 API
Categories.ReverseIterator Method
Retrieves a backward moving iterator to the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public override CategoryNameMapIterator ReverseIterator()
Visual Basic
Public Overrides Function ReverseIterator As CategoryNameMapIterator
Visual C++
public:
virtual CategoryNameMapIterator^ ReverseIterator() override
Return Value
A backward moving iterator to the map.
See Also
Categories Class
Autodesk.Revit.DB Namespace